Repository: nthanhthan/ecovelo_app
Catalog: lib/l10n/intl_*.arb
Languages: vi

source: Processing...
vi: Đang xử lí...

source: Ok
vi: Đồng ý

source: Cancel
vi: Huỷ

source: Confirm
vi: Xác nhận

source: Done
vi: Xong

source: Next
vi: Tiếp

source: Back
vi: Quay lại

source: Skip
vi: Bỏ qua

source: Welcome!
vi: Chào đón!

source: Home
vi: Trang chủ

# onBoarding1Title
source: Locate Stations Nearby
vi: Xác định vị trí các trạm lân cận

# onBoarding2Title
source: Ride and Explore
vi: Đi xe và khám phá

# onBoarding3Title
source: Personalized recommendations based on your interactions
vi: Các đề xuất được cá nhân hóa dựa trên tương tác của bạn

# onBoardingPage1Description
source: Quickly find a bike rental station near you to start your ride.
vi: Nhanh chóng tìm một trạm cho thuê xe đạp gần bạn để bắt đầu chuyến đi của bạn.

# onBoardingPage2Description
source: Explore the city on our reliable and comfortable bikes, and have fun along the way.
vi: Khám phá thành phố trên những chiếc xe đạp đáng tin cậy và thoải mái của chúng tôi, và tận hưởng niềm vui trên đường đi.

# onBoardingPage3Description
source: Our app learns from your interactions to provide personalized recommendations and suggestions that suit your specific needs and preferences
vi: Ứng dụng của chúng tôi học hỏi từ các tương tác của bạn để cung cấp các đề xuất và đề xuất được cá nhân hóa phù hợp với nhu cầu và sở thích cụ thể của bạn

# invalidEmailAddress
source: Please enter your email address in format: yourname@example.com
vi: Vui lòng nhập địa chỉ email của bạn ở định dạng: yourname@example.com

source: Password
vi: Mật khẩu

source: Sign In
vi: Đăng nhập

source: Forgot password?
vi: Quên mật khẩu?

source: Sign Up
vi: Đăng kí

# noAccount
source: Don't have an account?
vi: Bạn chưa có tài khoản?

# invalidPasswordLength
source: At least eight characters
vi: Ít nhất 8 kí tự

# invalidPasswordOneLetter
source: At least one letter
vi: Ít nhất một chữ cái

# invalidPasswordOneSpecialLetter
source: At least one special letter
vi: Ít nhất một kí tự đặc biệt

# invalidPasswordOneNumber
source: At least one number
vi: Ít nhất có một chữ số

# invalidPasswordOneCapitalLetter
source: At least one capital letter
vi: Ít nhất có một kí tự viết hoa

source: Language
vi: Ngôn ngữ

# changePass
source: Chnage Password
vi: Thay đổi mật khẩu

# notifi
source: Notification
vi: Thông báo

# deactiveAcc
source: Deactive Account
vi: Huỷ tài khoản

source: Help Center
vi: Trung tâm hỗ trợ

source: About
vi: Thông tin

source: Logout
vi: Đăng xuất

source: English
vi: Tiếng Anh

source: VietNamese
vi: Tiếng Việt

# niceDay
source: Have a nice day!
vi: Một ngày tốt lành!

# hi
source: Hi {name},
vi: Chào {name},

source: Scan to Ride
vi: Quét mã để đạp xe

source: Unable to access camera!
vi: Không thể truy cập máy ảnh!

# cameraAccessDenied
source: Camera access denied. Let open the app setting to enable it!
vi: Máy ảnh chưa được cho phép. Vui lòng vào cài đặt để cấp phép cho máy ảnh!

# noCameraPermissionDesctiption
source: This app needs camera access to scan QR codes
vi: Ứng dụng này cần máy ảnh để quét mã QR cho việc thuê xe

# textBanner
source: Let's enjoy a stress-free ride during peak hours and
vi: Hãy tận hưởng một chuyến đi thoải mái trong giờ cao điểm và

# discout
source: get 10% off.
vi: nhận được 10% vào điểm thưởng

# mainWallet
source: Main Point
vi: Điểm chính

# promoWallet
source: Promo Point
vi: Điểm thưởng

source: Add money
vi: Nạp điểm

source: My Wallet
vi: Ví của tôi

source: My journey
vi: Hành trình của tôi

source: Eco Voucher
vi: Khuyến mãi Eco

# readyRide
source: Ready to Ride
vi: Sẵn sàng đạp xe

source: Ticket Type
vi: Loại vé

# discoutText
source: Discount
vi: Giảm giá

source: One-time Ticket
vi: Vẽ một chiều

source: Select Voucher
vi: Lựa chọn gói khuyến mãi

source: Introduction
vi: Giới thiệu

source: Need Help ?
vi: Cần sự giúp đỡ ?

# proceed
source: Proceed to start!
vi: Kéo sang để bắt đầu!

source: Finish ride
vi: Kết thúc chuyến đi

# continueBtn
source: Continue
vi: Tiếp tục

source: Distances
vi: Khoảng cách

# titleWeekPoint
source: This week points
vi: Điểm tuần này

# desWeekPoint
source: Keep participating in weekly chanllenges and earn rewards.
vi: Tiếp tục tham gia các thử thách hàng tuần và kiếm phần thưởng.

source: Total distances
vi: Tổng khoảng cách

source: Total time
vi: Tổng thời gian

# carbon
source: Carbon Reduced
vi: Carbon giảm

source: Energy
vi: Năng lượng

source: Recent Activities
vi: Hoạt động gần đây

# detail
source: View details
vi: Xem chi tiết

# journeyDetail
source: Journey Details
vi: Chi tiết hành trình

source: Share journey
vi: Chia sẻ hành trình

# titleTime
source: Time
vi: Thời gian

# titleJourneyCode
source: Journey Code
vi: Mã hành trình

# titlePayment
source: Payment Type
vi: Loại thanh toán

source: Report Problem
vi: Báo cáo sự cố

# submitBtn
source: Submit
vi: Gửi

source: Bike Number
vi: Mã xe

source: Select Problem
vi: Lựa chọn vấn đề

# unlock
source: Can't unlock
vi: Không thể khoá xe

source: QR error
vi: Mã QR lỗi

source: Lock broken
vi: Khoá bị hư

source: Bike vandalized
vi: Xe đạp bị phá hoại

# notBuyMorePoint
source: Can't buy more point
vi: Không thể nạp thêm điểm

# notFinishRide
source: Can't finish ride
vi: Không thể kết thúc chuyến đi

source: Flat tire
vi: Lốp xe bị mềm/ lủng

source: Other
vi: Vấn đề khác

# uploadImage
source: Upload Image or Video
vi: Tải hình ảnh lên

# titleDes
source: Description
vi: Mô tả

# hintDes
source: Enter desciption...
vi: Nhập mô tả...

# notesMustShorterThan
source: Desciption must be shorter than or equal to 255 characters
vi: Mô tả phải ngắn hơn hoặc bằng 255 ký tự

# enterMoney
source: Enter Money Amount
vi: Nhập số tiền

source: Select Source
vi: Chọn nguồn

source: Unable to access storage!
vi: Không thể truy cập bộ nhớ!

# storageAccessDenied
source: Storage access denied. Let open the app setting to enable it!
vi: Truy cập bộ nhớ bị từ chối. Hãy mở cài đặt ứng dụng để kích hoạt nó!

# pickeFileUsing
source: Pick file using?
vi: Chọn tệp bằng cách sử dụng?

source: Choose from Gallery
vi: Chọn từ phòng Gallery

# chooseFromFileDirectory
source: Choose file from Directory
vi: Chọn tệp từ Thư mục

source: Take Photo
vi: Chụp hình

source: File already exists!
vi: Tệp đã tồn tại!

source: Upload Another
vi: Tải lên khác

# fileTooLarge
source: File upload must be smaller than 10 Mb
vi: Tệp tải lên phải nhỏ hơn 10 Mb

source: Upload File
vi: Tải tệp lên

# haveAccount
source: Have been an account.
vi: Đã có tài khoản.

source: Phone Number
vi: Số điện thoại

source: Name
vi: Tên

# passWordAgain
source: Enter the password again
vi: Nhập lại mật khẩu

# goStation
source: Go!
vi: Đi!

source: Ready
vi: Sẵn sàng

# noBike
source: No available bikes
vi: Không có sẵn xe đạp

source: Your Address
vi: Địa chỉ của bạn

# stationNumber
source: ECO - Station {number}
vi: Trạm xe ECO- {number}

# noMatchPass
source: Password don't match
vi: Mật khẩu không khớp

# enterPass
source: Please enter your pass
vi: Vui lòng nhập mật khẩu của bạn

# correct
source: Password match
vi: Mật khẩu khớp

# noResultFound
source: No results found
vi: Không có kết quả nào được tìm thấy

# lableSearch
source: Search for EcoVelo stations
vi: Tìm kiếm trạm xe EcoVelo

# enterPhone
source: Please enter mobile number
vi: Vui lòng nhập số điện thoại

# validatePhone
source: Please enter valid mobile number
vi: Vui lòng nhập số điện thoại di động hợp lệ

# erEmailOrPasswordInvalid
source: Your phone number or password is incorrect.
vi: Số điện thoại hoặc mật khẩu của bạn không chính xác.

# signupsucess
source: Successful registration, login to continue.
vi: Đăng ký thành công, đăng nhập để tiếp tục.

# errorQR
source: QR Code is incorrect, please try again
vi: Mã QR không chính xác, vui lòng thử lại

# bicycleRented
source: Vehicle is in use, please change to another vehicle
vi: Xe đang sử dụng, xin đổi xe khác

# score
source: Minimum score is 5000, please recharge
vi: Điểm tối thiểu là 5000, vui lòng nạp tiền

# stopRentError
source: Return vehicle with problem, please try again
vi: Trả xe không được hoàn tất, vui lòng thử lại

# messageConfirmEnd
source: Are you want to end your trip?
vi: Bạn có muốn kết thúc chuyến đi của bạn?

# lockFirst
source: You must do the your bike lock first
vi: Bạn phải khóa xe đạp trước

# transferOk
source: Transfer Successfully
vi: Giao dịch thành công

source: Receipt
vi: Biên lai

source: Amount
vi: Số tiền

source: Fee
vi: Phí

source: Free
vi: Miễn phí

source: Date
vi: Ngày

source: Time
vi: Thời gian

source: Total
vi: Tổng

# transferError
source: Error! Please try again
vi: Lỗi! Vui lòng thử lại

# historyTransaction
source: Transaction History
vi: Lịch sử giao dịch

source: Enter Code
vi: Nhập mã xe

# findCode
source: Find and enter the code
vi: Tìm và nhập mã xe

# tellWithUs
source: Tell us your feedback
vi: Hãy cho chúng tôi biết phản hồi của bạn

# writeSometh
source: Write something for us!
vi: Viết một cái gì đó cho chúng tôi!

source: Enter feedback
vi: Nhập phản hồi

source: Submit feedback
vi: Xác nhận phản hồi

source: Enter reason
vi: Nhập lí do

# reasonFall
source: Please enter the reason why the bike fell
vi: Vui lòng nhập lý do tại sao xe đạp bị ngã

# countFall
source: Bike Fall Count
vi: Số lần ngã xe

# thanksTrip
source: Thanks for being eco-conscious and choosing sustainable transportation.
vi: Cảm ơn bạn đã có ý thức bảo vệ môi trường và lựa chọn phương tiện giao thông bền vững.

# completeTrip
source: The journey is complete!
vi: Chuyến đi đã kết thúc!

# welcomeEcovelo
source: Welcome to EcoVelo!
vi: Chừng mừng đến với EcoVelo!

# loginToContinue
source: Please login to continue
vi: Vui lòng đăng nhập để tiếp tục

# createNewAcc
source: Create New Account
vi: Tạo tài khoản mới

# infoAcc
source: Please enter your information below
vi: Vui lòng nhập thông tin của bạn bên dưới

# uploadError
source: Error, please try again!
vi: Lỗi, Vui lòng thử lại!

source: Report Send
vi: Đã gửi báo cáo

# desReport
source: Hi, Your problem report has been sent successfully. Our team has received your report and we''ll do out best to help you resolve the issue as quickly as possible
vi: Xin chào, Báo cáo sự cố của bạn đã được gửi thành công. Nhóm của chúng tôi đã nhận được báo cáo của bạn và chúng tôi sẽ cố gắng hết sức để giúp bạn giải quyết vấn đề nhanh nhất có thể

# goBackHome
source: Go back to home
vi: Trở về trang chủ

# verifiAcc
source: Account Verification
vi: Xác minh tài khoản

# messVerifi
source: Please send a photo of your valid ID, original photo not scanned or photocopy
vi: Vui lòng gửi ảnh chụp giấy tờ tùy thân hợp lệ của bạn, ảnh gốc không được quét hoặc sao chụp

# choosePersonal
source: Choose the type of document
vi: Chọn loại giấy tờ

# takeTowSide
source: Take two-sided documents
vi: Chụp hai mặt giấy tờ

# frontView
source: Font view
vi: Mặt trước

source: Back view
vi: Mặt sau

source: Citizen ID
vi: Căn cước công dân

# cmnd
source: Identity Card
vi: CMND

# license
source: Motorbicycle License
vi: Giấy phép lái xe

# proccessingVerify
source: Authentication is in progress
vi: Đang xử lí xác thực

# questionLogout
source: Are you sure you want to log out?
vi: Bạn có chắc chắn muốn thoát ứng dụng không?

# confirmLogout
source: Yes, Logout
vi: Đồng ý

# stationNearMe
source: Station near
vi: Trạm xe gần tôi

# errorFeedback
source: Sorry, Processing is failing, please try again later.
vi: Xin lỗi, Quá trình xử lý không thành công, vui lòng thử lại sau.

# timeMinutes
source: minutes
vi: Phút

# complete
source: Completed
vi: Đã hoàn thành

# accountMustVeifi
source: Sorry, Your account haven't been verified
vi: Xin lỗi, tài khoản của bạn chưa được xác minh

# temoraryLock
source: Do you want to temporarily lock the bicycle?
vi: Bạn muốn khoá xe tạm thời phải không

# endTripError
source: Sorry,There is a problem with processing, please try again!
vi: Xin lỗi, Quá trình xử lí gặp vấn đề, vui lòng thử lại!

# temoraryLockError
source: Sorry, Temporarily lock the bicycle error
vi: Xin lỗi, Khoá xe tạm thời gặp vấn đề.

# openLockContinue
source: Do you want to unlock the car to continue?
vi: Bạn muốn mở khoá xe để tiếp tục phải không?

# fallBicycle
source: EcoVelo fell, please help me up. Thank you!
vi: EcoVelo ngã rồi, hãy giúp tôi đứng dậy nhé. Cảm ơn bạn!

source: Profile
vi: Thông tin cá nhân

# accUser
source: Eco User
vi: Người dùng Eco

source: Fix Problem
vi: Sửa sự cố

# station
source: Eco Station
vi: Trạm Eco

source: Revenue
vi: Doanh thu

source: Total User
vi: Tổng số người dùng

# authenticated
source: Authenticated User
vi: Người dùng đã xác thực

# unauthenticated
source: Unauthenticated User
vi: Người dùng chưa xác thực

source: Pending processing
vi: Đang chờ xử lý

source: Total Rent
vi: Tổng số lượt thuê

source: Num Fall
vi: Số lần ngã

source: User Detail
vi: Chi tiết người dùng

source: Change Role
vi: Thay đổi vai trò

# authenUser
source: User Authencation
vi: Xác thực người dùng

# typeDocument
source: Type User's Document
vi: Loại tài liệu của người dùng
